Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/svd/PIC32CK2051GC00144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x4481A000</baseAddress>
         <interrupt>
            <name>TCC1_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>75</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>76</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>77</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>78</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC3</name>
            <description>TCC Match/Compare 3</description>
            <value>79</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC4</name>
            <description>TCC Match/Compare 4</description>
            <value>80</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC5</name>
            <description>TCC Match/Compare 5</description>
            <value>81</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x4481C000</baseAddress>
         <interrupt>
            <name>TCC2_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>82</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>83</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>84</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>85</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC3</name>
            <description>TCC Match/Compare 3</description>
            <value>86</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC4</name>
            <description>TCC Match/Compare 4</description>
            <value>87</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC5</name>
            <description>TCC Match/Compare 5</description>
            <value>88</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC3</name>
         <baseAddress>0x4481E000</baseAddress>
         <interrupt>
            <name>TCC3_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>89</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>90</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>91</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>92</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC3</name>
            <description>TCC Match/Compare 3</description>
            <value>93</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC4</name>
            <description>TCC Match/Compare 4</description>
            <value>94</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC5</name>
            <description>TCC Match/Compare 5</description>
            <value>95</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC4</name>
         <baseAddress>0x45008000</baseAddress>
         <interrupt>
            <name>TCC4_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>120</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>121</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>122</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC5</name>
         <baseAddress>0x4500A000</baseAddress>
         <interrupt>
            <name>TCC5_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>123</value>
         </interrupt>
         <interrupt>
            <name>TCC5_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>124</value>
         </interrupt>
         <interrupt>
            <name>TCC5_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>125</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC6</name>
         <baseAddress>0x4500C000</baseAddress>
         <interrupt>
            <name>TCC6_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>126</value>
         </interrupt>
         <interrupt>
            <name>TCC6_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>127</value>
         </interrupt>
         <interrupt>
            <name>TCC6_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>128</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC7</name>
         <baseAddress>0x4500E000</baseAddress>
         <interrupt>
            <name>TCC7_OTHER</name>
            <description>Error/Overflow/Underflow/Fault Interrupt</description>
            <value>129</value>
         </interrupt>
         <interrupt>
            <name>TCC7_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>130</value>
         </interrupt>
         <interrupt>
            <name>TCC7_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>131</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TPIU</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Trace Port Interface Unit</description>
         <baseAddress>0xE0040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SSPSR</name>
               <description>TPIU Supported Parallel Port Sizes Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SWIDTH</name>
                     <description>Supported widths - 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSPSR</name>
               <description>TPIU Current Parallel Port Sizes Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CWIDTH</name>
                     <description>Current parallel trace port widthi - 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACPR</name>
               <description>TPIU Asynchronous Clock Prescaler Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SWOSCALER</name>
                     <description>SWO baud rate prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPPR</name>
               <description>TPIU Selected Pin Protocol Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXMODE</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TXMODESelect</name>
                        <enumeratedValue>
                           <name>PARALLEL</name>
                           <description>Parallel trace port mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAN</name>
                           <description>Asynchronous SWO, using Manchester encoding</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NRZ</name>
                           <description>Asynchronous SWO, using NRZ encoding</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFSR</name>
               <description>TPIU Formatter and Flush Status Register</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FInProg</name>
                     <description>Flush in progress</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FtStopped</name>
                     <description>Formatter stopped</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCPresent</name>
                     <description>TRACECTL pin is present</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FtNonStop</name>
                     <description>Non-stop formatter</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FFCR</name>
               <description>TPIU Formatter and Flush Control Register</description>
               <addressOffset>0x304</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EnFmt</name>
                     <description>Output formatting mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EnFmtSelect</name>
                        <enumeratedValue>
                           <name>BYPASS</name>
                           <description>Disable formatting</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONT</name>
                           <description>Continuous formatting and embed triggers and null cycles</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FOnMan</name>
                     <description>Flush On Manual</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TrigIn</name>
                     <description>Trigger input asserted</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSCR</name>
               <description>TPIU Periodic Synchronization Control Register</description>
               <addressOffset>0x308</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PSCount</name>
                     <description>Periodic Synchronization Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LAR</name>
               <description>TPIU Software Lock Access Register</description>
               <addressOffset>0xFB0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Lock access control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>UNLOCK</name>
                           <description>Unlock key value</description>
                           <value>0xC5ACCE55</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LSR</name>
               <description>TPIU Software Lock Status Register</description>
               <addressOffset>0xFB4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SLI</name>
                     <description>Software Lock implemented</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLK</name>
                     <description>Software Lock status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>nTT</name>
                     <description>Not thirty-two bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVID</name>
               <description>TPIU Device Identifier Register</description>
               <addressOffset>0xFC8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DWTENA</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVTYPE</name>
               <description>TPIU Device Type Register</description>
               <addressOffset>0xFCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MAJOR</name>
                     <description>Major type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUB</name>
                     <description>Sub-type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR4</name>
               <description>TPIU Peripheral Identification Register 4</description>
               <addressOffset>0xFD0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_2</name>
                     <description>JEP106 continuation code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SIZE</name>
                     <description>4KB count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR5</name>
               <description>TPIU Peripheral Identification Register 5</description>
               <addressOffset>0xFD4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR6</name>
               <description>TPIU Peripheral Identification Register 6</description>
               <addressOffset>0xFD8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR7</name>
               <description>TPIU Peripheral Identification Register 7</description>
               <addressOffset>0xFDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>PIDR0</name>
               <description>TPIU Peripheral Identification Register 0</description>
               <addressOffset>0xFE0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_0</name>
                     <description>Part number bits[7:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR1</name>
               <description>TPIU Peripheral Identification Register 1</description>
               <addressOffset>0xFE4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PART_1</name>
                     <description>Part number bits[11:8]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DES_0</name>
                     <description>JEP106 identification code bits [3:0]</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR2</name>
               <description>TPIU Peripheral Identification Register 2</description>
               <addressOffset>0xFE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DES_1</name>
                     <description>JEP106 identification code bits[6:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>JEDEC</name>
                     <description>JEDEC assignee value is used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Component revision</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PIDR3</name>
               <description>TPIU Peripheral Identification Register 3</description>
               <addressOffset>0xFEC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMOD</name>
                     <description>Customer Modified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REVAND</name>
                     <description>RevAnd</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIDR0</name>
               <description>TPIU Component Identification Register 0</description>
               <addressOffset>0xFF0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000D</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_0</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIDR1</name>
               <description>TPIU Component Identification Register 1</description>
               <addressOffset>0xFF4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000090</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_1</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLASS</name>
                     <description>CoreSight component class</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
